# Análise e Tratamento de Dados de Funcionários

Este projeto realiza a exploração, limpeza, transformação e geração de métricas a partir de uma base de dados de funcionários, utilizando a biblioteca Pandas.

## 1. Importação das Bibliotecas e Leitura do Dataset

In [ ]:
import pandas as pd
df = pd.read_csv('https://docs.google.com/spreadsheets/d/e/2PACX-1vSpCW9yMoUMQ4tknj5Lg_TYVfIC3P9KoVPPqlJKsBu2HzGaC579yCp9Ohxni2ncY-xyLfugXan9K6yf/pub?gid=636707205&single=true&output=csv')
display(df)

## 2. Exploração Inicial da Base

Análise da estrutura do dataset, volume de dados e presença de valores ausentes.

In [2]:

# Verificando o número de linhas e colunas do DataFrame
df.shape

(50, 8)

In [3]:
#Tipos de dados de cada coluna 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   ID                       50 non-null     int64
 1   Nome                     45 non-null     object
 2   Idade                    47 non-null     float64
 3   Salário                  45 non-null     float64
 4   Cargo                    47 non-null     object
 5   Departamento             48 non-null     object
 6   Data de Contratação      45 non-null     object
 7   Avaliação de Desempenho  50 non-null     float64
dtypes: float64(3), int64(1), object(4)
memory usage: 3.3+ KB

In [4]:
#Contagem de registros com informações completas (sem valores ausentes)
len(df.dropna())

29

In [5]:
# Analisando os cargos presentes na base de dados
cargos_unicos = df['Cargo'].unique()
display(cargos_unicos)

array(['Florista', nan, 'Lutador de jiu-jitsu', 'DJ', 'Neurocirurgião',
       'Ginecologista', 'Bedel', 'Lubrificador de máquinas',
       'Jogador de futebol', 'Piloto de avião', 'Cameraman',
       'Odontologista estético', 'Moldureiro', 'Dublador', 'Bioquímico',
       'Traumatologista', 'Instrumentista musical', 'Cartunista',
       'Tecnólogo em automação industrial', 'Balconista', 'Cantor',
       'Cozinheira', 'Tecnólogo em rochas ornamentais', 'Taxista',
       'Moleiro', 'Protético dentário', 'Pianista', 'Cinegrafista',
       'Intérprete de Bíblias', 'Carnavalesco', 'Geógrafo', 'Empacotador',
       'Ator', 'Imunologista', 'Quiropraxista', 'Ferroviário',
       'Publicitário', 'Segurança particular', 'Comerciante',
       'Artista de circo', 'Capitão', 'Jogador de handebol', 'Figurante',
       'Telegrafista', 'Judoca', 'Ortoptista', 'Garçom'], dtype=object)

## 3. Tratamento e Padronização dos Dados

Limpeza, normalização e correção dos dados para análise.

In [6]:
# Analisando os salários presentes na base de dados
salario_medio = df['Salário'].mean()
df['Salário'].fillna(df['Salário'].mean(),inplace=True)
novo_salario = df['Salário'].mean()
print(salario_medio)

5865.925111111112

C:\Users\danyd\AppData\Local\Temp\ipykernel_20248\3550568230.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salário'].fillna(df['Salário'].mean(),inplace=True)

In [7]:
# Criando uma nova coluna "Tecnologia da Informação" com base na coluna "Departamento"
df['Tecnologia da Informação'] = df['Departamento'].replace({'TI':'Tecnologia da Informação'})
df['Tecnologia da Informação']

0                   Financeiro
1                    Operações
2                          NaN
3                    Operações
4                           RH
5                           RH
6                   Financeiro
7                    Operações
8                    Marketing
9                          NaN
10                   Operações
11                   Operações
12                          RH
13    Tecnologia da Informação
14                          RH
15                  Financeiro
16    Tecnologia da Informação
17                   Marketing
18                          RH
19                  Financeiro
20                  Financeiro
21                          RH
22    Tecnologia da Informação
23                   Marketing
24                          RH
25                   Marketing
26                          RH
27                   Marketing
28                   Marketing
29                          RH
30                   Marketing
31    Tecnologia da Informação
32    Tecnologia da Informação
33                  Financeiro
34                   Marketing
35                          RH
36    Tecnologia da Informação
37                          RH
38                          RH
39                  Financeiro
40                   Marketing
41                          RH
42    Tecnologia da Informação
43                   Operações
44                   Marketing
45                   Operações
46                   Operações
47                   Operações
48    Tecnologia da Informação
49                          RH
Name: Tecnologia da Informação, dtype: object

In [8]:
# Convertendo a coluna "Data de Contratação" para o formato de data
df['Data de Contratação'] = pd.to_datetime(df['Data de Contratação'], errors='coerce')

In [9]:
# Convertendo a coluna "Avaliação de Desempenho" para o tipo inteiro
df['Avaliação de Desempenho'] = df['Avaliação de Desempenho'].astype(int)
display(df['Avaliação de Desempenho'].dtype)

dtype('int32')

## 4. Engenharia de Atributos

Criação de novas variáveis e transformação de atributos existentes.

In [10]:
df['Anos Trabalhados'] = df['Data de Contratação'].apply(lambda x: (pd.Timestamp.now()- x).days/365 if pd.notnull(x) else None)
df[['Nome','Anos Trabalhados']]

               Nome  Anos Trabalhados
0              Juan          1.983562
1          Isabelly          2.893151
2              Cauê          3.578082
3              Theo               NaN
4      Pedro Miguel          1.717808
5            Emilly          5.745205
6         Valentina          4.095890
7              Laís          1.750685
8           Beatriz          3.298630
9            Olivia          3.021918
10              NaN          5.391781
11          Daniela               NaN
12     Pedro Miguel          3.238356
13          Matheus          3.252055
14              NaN          1.583562
15          Sabrina          3.073973
16          Marcela          2.701370
17           Marina          4.520548
18            Luigi               NaN
19       Ana Sophia          2.142466
20            Isaac          5.695890
21       Ana Sophia          5.654795
22          Nicolas          3.065753
23             João          4.169863
24           Stella          1.487671
25          Rodrigo          2.830137
26            Bruna          4.813699
27    Luiz Henrique          2.734247
28            Luigi          4.509589
29            Alice          5.706849
30              NaN          2.715068
31          Beatriz          4.057534
32              NaN          4.775342
33          Sabrina          5.739726
34            Bruna          2.572603
35           Amanda          2.498630
36             Igor          1.641096
37  Marcos Vinicius          4.967123
38        Francisco               NaN
39           Felipe               NaN
40           Camila          4.339726
41    Maria Vitória          2.931507
42            Luigi          4.421918
43          Marcela          3.301370
44        Ana Clara          2.871233
45            Diogo          4.583562
46     Maria Sophia          2.624658
47          Rafaela          1.761644
48         Fernanda          5.906849
49              NaN          4.791781

In [11]:
df['Categoria de Salário'] = df['Salário'].apply(lambda x: 'Baixo' if x < 3000 else 'Médio' if x <= 7000 else 'Alto')
display(df[['Nome', 'Salário', 'Categoria de Salário']])

               Nome      Salário Categoria de Salário
0              Juan  9276.790000                 Alto
1          Isabelly  5865.925111                Médio
2              Cauê  3692.610000                Médio
3              Theo  2092.810000                Baixo
4      Pedro Miguel  5944.170000                Médio
5            Emilly  3272.550000                Médio
6         Valentina  5974.310000                Médio
7              Laís  4802.080000                Médio
8           Beatriz  8775.870000                 Alto
9            Olivia  5483.960000                Médio
10              NaN  5865.925111                Médio
11          Daniela  9867.300000                 Alto
12     Pedro Miguel  2341.040000                Baixo
13          Matheus  3789.400000                Médio
14              NaN  3381.050000                Médio
15          Sabrina  2843.480000                Baixo
16          Marcela  6154.510000                Médio
17           Marina  7286.350000                 Alto
18            Luigi  8527.650000                 Alto
19       Ana Sophia  6487.000000                Médio
20            Isaac  5063.650000                Médio
21       Ana Sophia  6886.180000                Médio
22          Nicolas  7663.330000                 Alto
23             João  9911.710000                 Alto
24           Stella  7602.380000                 Alto
25          Rodrigo  5865.925111                Médio
26            Bruna  9833.680000                 Alto
27    Luiz Henrique  5865.925111                Médio
28            Luigi  2487.610000                Baixo
29            Alice  5948.400000                Médio
30              NaN  8609.800000                 Alto
31          Beatriz  6126.690000                Médio
32              NaN  5801.450000                Médio
33          Sabrina  6427.740000                Médio
34            Bruna  2963.380000                Baixo
35           Amanda  9479.600000                 Alto
36             Igor  3786.160000                Médio
37  Marcos Vinicius  4897.860000                Médio
38        Francisco  5489.690000                Médio
39           Felipe  6453.130000                Médio
40           Camila  5471.340000                Médio
41    Maria Vitória  3758.970000                Médio
42            Luigi  5865.925111                Médio
43          Marcela  9325.740000                 Alto
44        Ana Clara  9647.460000                 Alto
45            Diogo  1868.900000                Baixo
46     Maria Sophia  5093.680000                Médio
47          Rafaela  7884.490000                 Alto
48         Fernanda  2983.610000                Baixo
49              NaN  2507.070000                Baixo

In [12]:
df['Desempenho Simplificado'] = df['Avaliação de Desempenho'].map(lambda x: 'Baixo' if x <= 3 else 'Médio' if x <= 7 else 'Alto' if pd.notnull(x) else 'Desconhecido')
display(df[['Nome', 'Desempenho Simplificado']])

               Nome Desempenho Simplificado
0              Juan                   Baixo
1          Isabelly                   Médio
2              Cauê                   Médio
3              Theo                   Baixo
4      Pedro Miguel                   Médio
5            Emilly                   Baixo
6         Valentina                    Alto
7              Laís                   Baixo
8           Beatriz                    Alto
9            Olivia                   Baixo
10              NaN                   Médio
11          Daniela                   Baixo
12     Pedro Miguel                   Baixo
13          Matheus                   Médio
14              NaN                   Médio
15          Sabrina                    Alto
16          Marcela                   Médio
17           Marina                   Baixo
18            Luigi                   Baixo
19       Ana Sophia                   Médio
20            Isaac                   Médio
21       Ana Sophia                   Baixo
22          Nicolas                   Baixo
23             João                   Baixo
24           Stella                   Baixo
25          Rodrigo                    Alto
26            Bruna                    Alto
27    Luiz Henrique                   Baixo
28            Luigi                    Alto
29            Alice                   Baixo
30              NaN                    Alto
31          Beatriz                   Médio
32              NaN                   Médio
33          Sabrina                    Alto
34            Bruna                   Médio
35           Amanda                    Alto
36             Igor                    Alto
37  Marcos Vinicius                   Médio
38        Francisco                   Médio
39           Felipe                   Médio
40           Camila                   Baixo
41    Maria Vitória                   Baixo
42            Luigi                    Alto
43          Marcela                   Baixo
44        Ana Clara                   Baixo
45            Diogo                   Médio
46     Maria Sophia                    Alto
47          Rafaela                   Médio
48         Fernanda                   Baixo
49              NaN                   Baixo

In [13]:
df['idade_5mais'] = df['Idade'].map(lambda x: x+5)
display(df[['Nome','Idade','idade_5mais']])

               Nome  Idade  idade_5mais
0              Juan   42.0         47.0
1          Isabelly   65.0         70.0
2              Cauê   35.0         40.0
3              Theo   34.0         39.0
4      Pedro Miguel   47.0         52.0
5            Emilly   19.0         24.0
6         Valentina   62.0         67.0
7              Laís   30.0         35.0
8           Beatriz   23.0         28.0
9            Olivia   52.0         57.0
10              NaN   58.0         63.0
11          Daniela   63.0         68.0
12     Pedro Miguel   23.0         28.0
13          Matheus   35.0         40.0
14              NaN   23.0         28.0
15          Sabrina   51.0         56.0
16          Marcela    NaN          NaN
17           Marina   48.0         53.0
18            Luigi   56.0         61.0
19       Ana Sophia   33.0         38.0
20            Isaac    NaN          NaN
21       Ana Sophia   41.0         46.0
22          Nicolas   30.0         35.0
23             João    NaN          NaN
24           Stella   55.0         60.0
25          Rodrigo   56.0         61.0
26            Bruna   43.0         48.0
27    Luiz Henrique   41.0         46.0
28            Luigi   63.0         68.0
29            Alice   61.0         66.0
30              NaN   45.0         50.0
31          Beatriz   57.0         62.0
32              NaN   36.0         41.0
33          Sabrina   59.0         64.0
34            Bruna   33.0         38.0
35           Amanda   25.0         30.0
36             Igor   63.0         68.0
37  Marcos Vinicius   21.0         26.0
38        Francisco   50.0         55.0
39           Felipe   38.0         43.0
40           Camila   32.0         37.0
41    Maria Vitória   38.0         43.0
42            Luigi   32.0         37.0
43          Marcela   28.0         33.0
44        Ana Clara   33.0         38.0
45            Diogo   23.0         28.0
46     Maria Sophia   29.0         34.0
47          Rafaela   60.0         65.0
48         Fernanda   61.0         66.0
49              NaN   57.0         62.0

## 5. Análises e Métricas

Geração de insights, métricas de desempenho e visualizações.

In [146]:
df['salario_alto'] = df['Salário'].max()
nome_sal= df.query('Salário == salario_alto')[['Nome','Salário','Cargo']]
display(nome_sal)

    Nome  Salário       Cargo
23  João  9911.71  Cozinheira

In [147]:
quantidade = df.query('Departamento == "Marketing"').shape[0]
print(f'A quantidade de funcionários no departamento de Marketing é de:{quantidade}')

A quantidade de funcionários no departamento de Marketing é de:10

In [148]:
idade_media = df[['Idade','Departamento']].groupby('Departamento').mean()
display(round(idade_media),1)

              Idade
Departamento
Financeiro     48.0
Marketing      42.0
Operações      43.0
RH             40.0
TI             45.0

1

In [149]:
idade_media = df[['Idade','Departamento']].groupby('Departamento').mean()
display(round(idade_media),1)

              Idade
Departamento
Financeiro     48.0
Marketing      42.0
Operações      43.0
RH             40.0
TI             45.0

1

In [150]:
top_5_funcionarios = df.sort_values(by='Anos Trabalhados', ascending=False).head(5)
display(top_5_funcionarios[['Nome', 'Departamento', 'Anos Trabalhados']])

        Nome Departamento  Anos Trabalhados
48  Fernanda           TI          5.906849
5     Emilly           RH          5.745205
33   Sabrina   Financeiro          5.739726
29     Alice           RH          5.706849
20     Isaac   Financeiro          5.695890

In [151]:
quantidade = df[df['Avaliação de Desempenho'] > 8].shape[0]
display(quantidade)

7

In [152]:
salario_total = df.groupby('Departamento')['Salário'].sum().reset_index()
display(round(salario_total),2)

  Departamento  Salário
0   Financeiro  42526.0
1    Marketing  66885.0
2    Operações  52667.0
3           RH  79870.0
4           TI  42171.0

2

In [153]:
top_5_jovens = df.sort_values(by='Idade', ascending=True).head(5)
display(top_5_jovens)

,ID,Nome,Idade,Salário,Cargo,Departamento,Data de Contratação,Avaliação de Desempenho,Tecnologia da Informação,Anos Trabalhados,Categoria de Salário,Desempenho Simplificado,idade_5mais,salario_alto
5,6,Emilly,19.0,3272.55,Ginecologista,RH,2020-05-28,3,RH,5.745205,Médio,Baixo,24.0,9911.71
37,38,Marcos Vinicius,21.0,4897.86,Ferroviário,RH,2021-03-08,6,RH,4.967123,Médio,Médio,26.0,9911.71
12,13,Pedro Miguel,23.0,2341.04,Moldureiro,RH,2022-11-29,1,RH,3.238356,Baixo,Baixo,28.0,9911.71
14,15,NaN,23.0,3381.05,Bioquímico,RH,2024-07-25,5,RH,1.583562,Médio,Médio,28.0,9911.71
8,9,Beatriz,23.0,8775.87,Jogador de futebol,Marketing,2022-11-07,9,Marketing,3.298630,Alto,Alto,28.0,9911.71

In [154]:
sem_registro = df[df['Salário'].isna()]
display(sem_registro)

Empty DataFrame
Columns: [ID, Nome, Idade, Salário, Cargo, Departamento, Data de Contratação, Avaliação de Desempenho, Tecnologia da Informação, Anos Trabalhados, Categoria de Salário, Desempenho Simplificado, idade_5mais, salario_alto]
Index: []

In [155]:
altos_salarios = len(df[df['Categoria de Salário'] == 'Alto'])
print(f"Existem {altos_salarios} funcionários na categoria de salário 'Alto'.")

Existem 14 funcionários na categoria de salário 'Alto'.

## 6. Exportação do Dataset Limpo

Salvar os dados limpos para uso futuro.

In [156]:
df_limpo = df.dropna()
df_limpo.to_csv('df_limpo.csv', index=False)
display(df_limpo)

,ID,Nome,Idade,Salário,Cargo,Departamento,Data de Contratação,Avaliação de Desempenho,Tecnologia da Informação,Anos Trabalhados,Categoria de Salário,Desempenho Simplificado,idade_5mais,salario_alto
0,1,Juan,42.0,9276.790000,Florista,Financeiro,2024-03-01,3,Financeiro,1.983562,Alto,Baixo,47.0,9911.71
4,5,Pedro Miguel,47.0,5944.170000,Neurocirurgião,RH,2024-06-06,6,RH,1.717808,Médio,Médio,52.0,9911.71
5,6,Emilly,19.0,3272.550000,Ginecologista,RH,2020-05-28,3,RH,5.745205,Médio,Baixo,24.0,9911.71
6,7,Valentina,62.0,5974.310000,Bedel,Financeiro,2022-01-20,9,Financeiro,4.095890,Médio,Alto,67.0,9911.71
7,8,Laís,30.0,4802.080000,Lubrificador de máquinas,Operações,2024-05-25,3,Operações,1.750685,Médio,Baixo,35.0,9911.71
8,9,Beatriz,23.0,8775.870000,Jogador de futebol,Marketing,2022-11-07,9,Marketing,3.298630,Alto,Alto,28.0,9911.71
12,13,Pedro Miguel,23.0,2341.040000,Moldureiro,RH,2022-11-29,1,RH,3.238356,Baixo,Baixo,28.0,9911.71
13,14,Matheus,35.0,3789.400000,Dublador,TI,2022-11-24,7,Tecnologia da Informação,3.252055,Médio,Médio,40.0,9911.71
19,20,Ana Sophia,33.0,6487.000000,Cartunista,Financeiro,2024-01-03,6,Financeiro,2.142466,Médio,Médio,38.0,9911.71
21,22,Ana Sophia,41.0,6886.180000,Balconista,RH,2020-06-30,2,RH,5.654795,Médio,Baixo,46.0,9911.71
22,23,Nicolas,30.0,7663.330000,Cantor,TI,2023-01-31,3,Tecnologia da Informação,3.065753,Alto,Baixo,35.0,9911.71
24,25,Stella,55.0,7602.380000,Tecnólogo em rochas ornamentais,RH,2024-08-29,2,RH,1.487671,Alto,Baixo,60.0,9911.71
25,26,Rodrigo,56.0,5865.925111,Taxista,Marketing,2023-04-27,8,Marketing,2.830137,Médio,Alto,61.0,9911.71
26,27,Bruna,43.0,9833.680000,Moleiro,RH,2021-05-03,9,RH,4.813699,Alto,Alto,48.0,9911.71
27,28,Luiz Henrique,41.0,5865.925111,Protético dentário,Marketing,2023-06-01,1,Marketing,2.734247,Médio,Baixo,46.0,9911.71
28,29,Luigi,63.0,2487.610000,Pianista,Marketing,2021-08-22,8,Marketing,4.509589,Baixo,Alto,68.0,9911.71
29,30,Alice,61.0,5948.400000,Cinegrafista,RH,2020-06-11,1,RH,5.706849,Médio,Baixo,66.0,9911.71
31,32,Beatriz,57.0,6126.690000,Carnavalesco,TI,2022-02-03,4,Tecnologia da Informação,4.057534,Médio,Médio,62.0,9911.71
33,34,Sabrina,59.0,6427.740000,Empacotador,Financeiro,2020-05-30,8,Financeiro,5.739726,Médio,Alto,64.0,9911.71
34,35,Bruna,33.0,2963.380000,Ator,Marketing,2023-07-30,5,Marketing,2.572603,Baixo,Médio,38.0,9911.71
35,36,Amanda,25.0,9479.600000,Imunologista,RH,2023-08-26,8,RH,2.498630,Alto,Alto,30.0,9911.71
36,37,Igor,63.0,3786.160000,Quiropraxista,TI,2024-07-04,9,Tecnologia da Informação,1.641096,Médio,Alto,68.0,9911.71
37,38,Marcos Vinicius,21.0,4897.860000,Ferroviário,RH,2021-03-08,6,RH,4.967123,Médio,Médio,26.0,9911.71
40,41,Camila,32.0,5471.340000,Ferroviário,Marketing,2021-10-23,3,Marketing,4.339726,Médio,Baixo,37.0,9911.71
41,42,Maria Vitória,38.0,3758.970000,Comerciante,RH,2023-03-21,2,RH,2.931507,Médio,Baixo,43.0,9911.71
42,43,Luigi,32.0,5865.925111,Artista de circo,TI,2021-09-23,10,Tecnologia da Informação,4.421918,Médio,Alto,37.0,9911.71
43,44,Marcela,28.0,9325.740000,Capitão,Operações,2022-11-06,3,Operações,3.301370,Alto,Baixo,33.0,9911.71
44,45,Ana Clara,33.0,9647.460000,Jogador de handebol,Marketing,2023-04-12,3,Marketing,2.871233,Alto,Baixo,38.0,9911.71
45,46,Diogo,23.0,1868.900000,Figurante,Operações,2021-07-26,6,Operações,4.583562,Baixo,Médio,28.0,9911.71
46,47,Maria Sophia,29.0,5093.680000,Telegrafista,Operações,2023-07-11,9,Operações,2.624658,Médio,Alto,34.0,9911.71
47,48,Rafaela,60.0,7884.490000,Judoca,Operações,2024-05-21,7,Operações,1.761644,Alto,Médio,65.0,9911.71
48,49,Fernanda,61.0,2983.610000,Ortoptista,TI,2020-03-30,3,Tecnologia da Informação,5.906849,Baixo,Baixo,66.0,9911.71